import random

answers = ["Бесспорно", "Мне кажется - да", "Пока неясно, попробуй снова", "Даже не думай",
           "Предрешено", "Вероятнее всего", "Спроси позже", "Мой ответ - нет",
           "Никаких сомнений", "Хорошие перспективы", "Лучше не рассказывать", "По моим данным - нет",
           "Можешь быть уверен в этом", "Да", "Сконцентрируйся и спроси опять", "Весьма сомнительно"]

print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.')
name=str(input('Даже твое имя (Введите своё имя) - '))
print('Чувствую, что тебя зовут -', name)
print('Здравствуй', name)

again = 'да'
while again.lower() == 'да':
    print('Задай свой вопрос,', name)
    input()
    print('Трясем шаром... ')
    print('Ответ на твой вопрос:')
    print(random.choice(answers))
    again = input('Есть ли другие вопросы? (да = да, нет = нет): ')

print('Возвращайся если возникнут вопросы!')